       IDENTIFICATION DIVISION.
       PROGRAM-ID. SaidaPersonalizadaVariaveis.
      *************************************
      * AREA DE COMENTARIOS -REMARKS
      * AUTHOR = LUAN
      * OBJETIVO: RECEBER E IMPRIMIR UMA STRING
      * DATA = 21/01/2021
      * OBJETIVO: RECEBER NOME E SALARIO
      * IMPRIMIR FORMATADO  - USO DA VIRGULA
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-CPF PIC X(11) VALUE SPACES.
       77 WRK-CPF-ED PIC ZZZ.ZZZ.ZZ9/99 VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-CPF FROM CONSOLE.
      ***************** MOSTRA DADOS
           MOVE WRK-CPF TO WRK-CPF-ED
           DISPLAY 'CPF ' WRK-CPF-ED.
           STOP RUN.
