       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULO.
      * AUTHOR = LUAN MAGALHAES
      * OBJETIVO = SOMAR VENDAS E TIRAR A SUA MEDIA
      * DATA = 22/01/2021
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-VENDA1 PIC 9(05)V99 VALUE ZEROS.
       77 WRK-VENDA2 PIC 9(05)V99 VALUE ZEROS.
       77 WRK-RESULT PIC 9(06)V99 VALUE ZEROS.
       77 WRK-RESULT-ED PIC $ZZ.ZZZ,99 VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-VENDA1 FROM CONSOLE.
           ACCEPT WRK-VENDA2 FROM CONSOLE.

           COMPUTE WRK-RESULT = (WRK-VENDA1 + WRK-VENDA2) / 2.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           DISPLAY 'MEDIA: ' WRK-RESULT-ED.
           STOP RUN.
