       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.
      ***************************
      * Área de comentários
      * Author Luan Magalhães
      * OBJETIVO: RECEBER 02 NOTAS, FAZER A MEDIA E IMPRIMIR STATUS, UTILIZANDO
      * IF/ELSE/ENDIF
      * DATA = 22/01/2021
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOTA1 PIC 9(02) VALUE ZEROS.
       77 WRK-NOTA2 PIC 9(02) VALUE ZEROS.
      * V9 PARA CASA DECIMAL
       77 WRK-MEDIA PIC 9(04)V9 VALUE ZEROS.
       77 WRK-MEDIA-ED PIC ZZ VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NOTA1 FROM CONSOLE.
           ACCEPT WRK-NOTA2 FROM CONSOLE.
           COMPUTE WRK-MEDIA = (WRK-NOTA1 + WRK-NOTA2) /2.
           MOVE WRK-MEDIA TO WRK-MEDIA-ED.
           DISPLAY 'MEDIA ' WRK-MEDIA-ED.
           EVALUATE WRK-MEDIA
               WHEN 10
                   DISPLAY 'APROVADO - BONUS'
      *O COMANDO THRU VAI ATÉ UM DELIMITADO VALOR
               WHEN 6 THRU 9,9
                   DISPLAY 'APROVADO'
               WHEN 2 THRU 5,5
                   DISPLAY 'RECUPERACAO'
      *QUANDO NENHUMA DAS CONDIÇÕES FOREM ATENDIDAS, IRÁ PARA WHEN OTHER
               WHEN OTHER
                   DISPLAY 'REPROVADO'
           END-EVALUATE.

           STOP RUN.
