       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.
      ***************************
      * Área de comentários
      * Author Luan Magalhães
      * OBJETIVO: TESTAR OPERADORES ARITMÉTICOS
      * DATA = 21/01/2021
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUM1 PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2 PIC 9(02) VALUE ZEROS.
       77 WRK-RESULT PIC 9(04) VALUE ZEROS.
       77 WRK-RESULT-ED PIC ZZ VALUE ZEROS.
       PROCEDURE DIVISION.
       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.


       0200-ENTRADA.
       ACCEPT WRK-NUM1 FROM CONSOLE.
       ACCEPT WRK-NUM2 FROM CONSOLE.


       0300-PROCESSAR.

       DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESULT.
       MOVE WRK-RESULT TO WRK-RESULT-ED.

       DISPLAY ' O VALOR E ....' WRK-RESULT-ED.
