       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX.



       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       77 WRK-ANO-ENTRADA-EMPRESA PIC 9(04) VALUE ZEROS.
       77 WRK-SALARIO-FUNCIONARIO PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-FINAL PIC 9(08)V99 VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-ANO-ENTRADA-EMPRESA > 0 AND WRK-SALARIO-FUNCIONARIO >0
                   PERFORM 0200-PROCESSAMENTO.
           PERFORM 0300-FINALIZAR.
           STOP-RUN.


       0100-INICIALIZAR.
           DISPLAY 'INFORME SEU NOME'.
           ACCEPT WRK-NOME FROM CONSOLE.

           DISPLAY 'INFORME O ANO DE ENTRADA NA EMPRESA'.
           ACCEPT WRK-ANO-ENTRADA-EMPRESA FROM CONSOLE.


           DISPLAY 'INFORME O SALÁRIO DO FUNCIONÁRIO'.
           ACCEPT WRK-SALARIO-FUNCIONARIO FROM CONSOLE.

       0200-PROCESSAMENTO.
           IF  WRK-ANO-ENTRADA-EMPRESA  <=1
               DISPLAY 'A SUA PORCENTAGEM DE AUMENTO É 0%'
           ELSE
               IF WRK-ANO-ENTRADA-EMPRESA <=5
                   COMPUTE WRK-SALARIO-FINAL =  WRK-SALARIO-FUNCIONARIO * 0,05
                   DISPLAY 'AUMENTO 5 %'
                   DISPLAY 'VALOR DO AUMENTO:  ' WRK-SALARIO-FINAL
               ELSE
                   IF WRK-ANO-ENTRADA-EMPRESA <= 15
                    COMPUTE WRK-SALARIO-FINAL = WRK-SALARIO-FUNCIONARIO * 0,1
                       DISPLAY 'AUMENTO 10%'
                       DISPLAY 'VALOR DO AUMENTO: ' WRK-SALARIO-FINAL
               ELSE
                   IF WRK-ANO-ENTRADA-EMPRESA >=16
                    COMPUTE WRK-SALARIO-FINAL = WRK-SALARIO-FUNCIONARIO * 0,15
                   DISPLAY 'AUMENTO 15%'
                   DISPLAY 'VALOR DO AUMENTO: ' WRK-SALARIO-FINAL

               END-IF.
       0300-FINALIZAR.
           DISPLAY'-----------------------'.
           DISPLAY'FINAL DE PROCESSAMENTO'.
               STOP-RUN.
