       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(03) VALUE ZEROS.
       77 WRK-NM2 PIC 9(03) VALUE ZEROS.
       77 WRK-RESULT PIC 9(03) VALUE ZEROS.


       PROCEDURE DIVISION.
       ACCEPT WRK-NM1 FROM CONSOLE.
       ACCEPT WRK-NM2 FROM CONSOLE.
       COMPUTE WRK-RESULT = (WRK-NM1 + WRK-NM2) / 2.
       DISPLAY ' O RESULTADO E....' WRK-RESULT.
       STOP RUN.
