       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-CPF PIC X(11) VALUE SPACES.
       77 WRK-CPF-ED PIC ZZZ.ZZZ.ZZ9/99.


       PROCEDURE DIVISION.
           DISPLAY 'INFORME O CPF'.
           ACCEPT WRK-CPF FROM CONSOLE.
           MOVE WRK-CPF TO WRK-CPF-ED.
           DISPLAY 'O CPF FORMATADO E: ' WRK-CPF-ED.

           STOP RUN.
