       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.

       ENVIRONMENT DIVISION.
      * CONFIGURANDO O PONTO DECIMAL PARA VÍRGULA.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUES SPACES.
      * COLOCANDO O V99 PRA INFORMAR QUE TERA DUAS CASAS DECIMAIS APÓS A VÍRGULA
       77 WRK-SALARIO PIC 9(6)V99 VALUE ZEROS.
      * VARIÁVEL DE MASCARÁ, QUE IRÁ RECEBER OS VALORES DENTRO DE UM FORMATO ESTABELECIDO
      * UTILIZANDO A MASCARÁ Z PARA OMITIR OS VALORES.
       77 WRK-SALARIO-ED PIC  $ZZZ.ZZ9,99 VALUE ZEROS.


       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.
      ****************** MOSTRA DADOS
           DISPLAY 'NOME: ' WRK-NOME.
      * MOVE O VALOR DE UMA VARIAVEL PARA OUTRA VARIAVEL
           MOVE WRK-SALARIO TO WRK-SALARIO-ED.
           DISPLAY 'SALARIO: ' WRK-SALARIO-ED.
           STOP RUN.
