       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.
      ***************************
      * Área de comentários
      * Author Luan Magalhães
      * OBJETIVO: USO DO SINAL (+ -)
      * DATA = 21/01/2021
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUM1 PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2 PIC 9(02) VALUE ZEROS.
      * USAMOS O S PARA INFORMAR QUE TEREMOS SINAL NO NÚMERO
       77 WRK-RESULT PIC S9(04) VALUE ZEROS.
       77 WRK-RESULT2 PIC S9(04) VALUE ZEROS.
       77 WRK-RESULT-ED PIC -ZZ9 VALUE ZEROS.
       77 WRK-RESULT-ED2 PIC +ZZ9 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY '==========================='.
           DISPLAY 'NUMERO 1: ' WRK-NUM1.
           DISPLAY 'NUMERO 2: ' WRK-NUM2.
           SUBTRACT WRK-NUM1 FROM WRK-NUM2 GIVING WRK-RESULT.
           SUBTRACT WRK-NUM2 FROM WRK-NUM1 GIVING WRK-RESULT.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           MOVE WRK-RESULT2 TO WRK-RESULT-ED2.
            DISPLAY 'O RESULTADO DA SUBTRAÇÃO É: ' WRK-RESULT-ED.
            DISPLAY 'O REUSLTADO DA SUBTRAÇÃO É: ' WRK-RESULT-ED2
           STOP RUN.
