       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.
      ***************************
      * Área de comentários
      * Author Luan Magalhães
      * OBJETIVO: USO DO SINAL (+ -)
      * DATA = 21/01/2021
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(03) VALUE ZEROS.
       77 WRK-NM2 PIC 9(03) VALUE ZEROS.
       77 WRK-RESULT PIC S9(04) VALUE ZEROS.
       77 WRK-RESULT-ED PIC -Z99 VALUE ZEROS.

       PROCEDURE DIVISION.
       ACCEPT WRK-NM1 FROM CONSOLE.
       ACCEPT WRK-NM2 FROM CONSOLE.
       SUBTRACT WRK-NM2 FROM WRK-NM1 GIVING WRK-RESULT.
       MOVE WRK-RESULT TO WRK-RESULT-ED.
       DISPLAY ' O RESULTADO E...' WRK-RESULT-ED.
       STOP RUN.
