       IDENTIFICATION DIVISION.
       PROGRAM-ID. AULA3.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
      * VARIAVEL PAI
      * VARIAVEL DO TIPO ESTRUTURADA TEM O PAI E SEUS FILHOS.
       01 WRK-DATA.
           02 WRK-ANO PIC 9(4) VALUE ZEROS.
           02 WRK-MES PIC 9(2) VALUE ZEROS.
           02 WRK-DIA PIC 9(2) VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'DIA ' WRK-DIA ' DO MES ' WRK-MES ' ANO DE ' WRK-ANO.
           STOP RUN.
