       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG01.
      ****************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR DO PROGRAMA = LUAN MAGALHÃES
      * DATA: 29/01/2021 E 19/02/2022
      ****************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
