       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-USUARIO PIC X(20)   VALUE SPACES.
       77 WRK-NIVEL   PIC 9(02) VALUE ZEROS.
           88 ADM     VALUE 01.
           88 USER    VALUE 02.
       PROCEDURE DIVISION.
       DISPLAY 'DIGITE O USUARIO...'
       ACCEPT WRK-USUARIO FROM CONSOLE.


       DISPLAY 'DIGITE O NIVEL'
       ACCEPT WRK-NIVEL FROM CONSOLE.


       IF ADM
           DISPLAY 'NIVEL - ADMINISTRADOR'
       ELSE
           IF USER
               DISPLAY 'NIVEL - USUARIO'
           ELSE
               DISPLAY 'INVALIDO'
           END-IF
       END-IF.
       STOP RUN.
