       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-LARGURA       PIC 9(03)V99   VALUE ZEROS.
       77 WRK-COMPRIMENTO   PIC 9(03)V99   VALUE ZEROS.
       77 WRK-AREA          PIC 9(05)V99   VALUE ZEROS.

       PROCEDURE DIVISION.
       DISPLAY 'INFORME A LARGURA'
       ACCEPT WRK-LARGURA FROM CONSOLE.


       DISPLAY 'INFORME A COMPRIMENTO'
       ACCEPT WRK-COMPRIMENTO FROM CONSOLE.


       IF WRK-LARGURA >0 AND WRK-COMPRIMENTO IS GREATER THAN 0
           COMPUTE WRK-AREA = (WRK-LARGURA * WRK-COMPRIMENTO )
           DISPLAY 'AREA....' WRK-AREA
       ELSE
           DISPLAY 'FALTA INFORMAR ALGO'
       END-IF.



       STOP RUN.
