       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-PRODUTO PIC X(20)   VALUE SPACES.
       77 WRK-ESTADO  PIC X(02)   VALUE SPACES.

       77 WRK-VALOR PIC 9(06)V99  VALUE ZEROS.
       77 WRK-FRETE PIC 9(04)V99  VALUE ZEROS.
       PROCEDURE DIVISION.

       DISPLAY 'INFORME O PRODUTO'.
       ACCEPT WRK-PRODUTO FROM CONSOLE.

       DISPLAY 'VALOR DO PRODUTO'.
       ACCEPT WRK-VALOR FROM CONSOLE.


       DISPLAY 'INFORME O ESTADO A ENTREGAR'.
       ACCEPT WRK-ESTADO FROM CONSOLE.

       EVALUATE WRK-ESTADO
           WHEN 'SP'
               COMPUTE WRK-FRETE = WRK-VALOR * 1.05
           WHEN 'RJ'
               COMPUTE WRK-FRETE = WRK-VALOR * 1.10
           WHEN 'MG'
               COMPUTE WRK-FRETE = WRK-VALOR * 1.15
           WHEN OTHER
               DISPLAY 'NAO PODEMOS ENTREGAR'
           END-EVALUATE.


           DISPLAY '===================='.
           IF WRK-FRETE NOT EQUAL 0
               DISPLAY 'VALOR DO FRETE COM O PRODUTO ' WRK-FRETE.
       STOP RUN.
