       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.
      ***************************
      * Área de comentários
      * Author Luan Magalhães
      * OBJETIVO: RECEBER 02 NOTAS, FAZER A MEDIA E IMPRIMIR STATUS, UTILIZANDO
      * IF/ELSE/ENDIF
      * DATA = 22/01/2021
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOTA1 PIC 9(02) VALUE ZEROS.
       77 WRK-NOTA2 PIC 9(02) VALUE ZEROS.
      * V9 PARA CASA DECIMAL
       77 WRK-MEDIA PIC 9(04)V9 VALUE ZEROS.
       77 WRK-SOMA PIC 9(04) VALUE ZEROS.
       77 WRK-MEDIA-ED PIC ZZ VALUE ZEROS.
       PROCEDURE DIVISION.
       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.
       STOP RUN.

       0200-ENTRADA.
       ACCEPT WRK-NOTA1 FROM CONSOLE.
       ACCEPT WRK-NOTA2 FROM CONSOLE.

       0300-PROCESSAR.
       ADD WRK-NOTA1 WRK-NOTA2 TO WRK-SOMA.
       DIVIDE WRK-SOMA BY 2 GIVING  WRK-MEDIA.


       IF WRK-MEDIA IS GREATER THAN 10
           DISPLAY 'APROVADO COM EXCELENCIA'
       ELSE
           IF WRK-MEDIA IS GREATER THAN 7
               DISPLAY 'APROVADO'
       ELSE
           DISPLAY 'REPROVADO'
       END-IF.
