       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABUADA.
      ********************************
      * ÁREA DE COMENTÁRIOS -REMARKS
      * AUTHOR = LUAN DE OLIVEIRA MAGALHÃES
      * OBJETIVO = RECEBER UM NÚMERO E GERAR A TABUADA DE 1 A 10.
      * UTILIZANDO O PERFORM


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NUMERO PIC 9(03) VALUE ZEROS.
       77 WRK-CONTADOR PIC 9(02) VALUE 0.
       77 WRK-RESULT PIC 9(03) VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           ACCEPT WRK-NUMERO FROM CONSOLE.

       PERFORM 0100-INICIALIZAR.
       IF WRK-NUMERO > 0
           PERFORM 0200-PROCESSAR
       END-IF.
           PERFORM 0300-FINALIZAR.

       STOP RUN.



       0100-INICIALIZAR.





       0200-PROCESSAR.
       PERFORM VARYING WRK-CONTADOR FROM 1 BY 2
                       UNTIL WRK-CONTADOR >= 10

       COMPUTE WRK-RESULT = WRK-NUMERO * WRK-CONTADOR
           DISPLAY WRK-NUMERO ' X ' WRK-CONTADOR ' = ' WRK-RESULT
       END-PERFORM.
       0300-FINALIZAR.
           DISPLAY '-----------'.
           DISPLAY 'FINAL DE PROCESSSAMENTO'.
