       IDENTIFICATION DIVISION.
       PROGRAM-ID. VariaveisTabela.
      *************************************
      * AREA DE COMENTARIOS -REMARKS
      * AUTHOR = LUAN MAGALHÃES
      * DATA = 23/01/2021
      * OBJETIVO: UTILIZAR VARIÁVEIS TIPO TABELA - OCCURS - REDEFINES
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WRK-MESES-EXTENSO.
           02 FILLER PIC X(03) VALUE 'JAN'.
           02 FILLER PIC X(03) VALUE 'FEV'.
           02 FILLER PIC X(03) VALUE 'MAR'.
           02 FILLER PIC X(03) VALUE 'ABR'.
           02 FILLER PIC X(03) VALUE 'MAI'.
           02 FILLER PIC X(03) VALUE 'JUN'.
           02 FILLER PIC X(03) VALUE 'JUL'.
           02 FILLER PIC X(03) VALUE 'AGO'.
           02 FILLER PIC X(03) VALUE 'SET'.
           02 FILLER PIC X(03) VALUE 'OUT'.
           02 FILLER PIC X(03) VALUE 'NOV'.
           02 FILLER PIC X(03) VALUE 'DEZ'.

       01 WRK-MESES REDEFINES WRK-MESES-EXTENSO.
           02 WRK-MES PIC X(03) OCCURS 12 TIMES.

         01 WRK-DATA.
           02 WRK-ANOYS PIC 9(04) VALUE ZEROS.
           02 WRK-MESYS PIC 9(02) VALUE ZEROS.
           02 WRK-DIAYS PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
             DISPLAY ' DATA ' WRK-DIAYS ' DE ' WRK-MES(WRK-MESYS)
             ' DE ' WRK-ANOYS.
           STOP RUN.
