       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA.
      ***************************
      * Área de comentários
      * Author Luan Magalhães
      * OBJETIVO: TESTAR OPERADORES ARITMÉTICOS
      * DATA = 21/01/2021
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUM1 PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2 PIC 9(02) VALUE ZEROS.
       77 WRK-RESULT PIC 9(04) VALUE ZEROS.
       77 WRK-RESTO PIC 9(04) VALUE ZEROS.
       77 WRK-RESULT-ED PIC ZZ VALUE ZEROS.
       77 WRK-RESTO-ED PIC ZZ9 VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY '==========================='.
           DISPLAY 'NUMERO 1: ' WRK-NUM1.
           DISPLAY 'NUMERO 2: ' WRK-NUM2.
           DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESULT
             REMAINDER WRK-RESTO.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           MOVE WRK-RESTO TO WRK-RESTO-ED.
            DISPLAY 'O RESULTADO DA DIVISAO É: ' WRK-RESULT-ED.
            DISPLAY 'O RESTO DA DIVISÃO É: ' WRK-RESTO-ED.
           STOP RUN.
