       IDENTIFICATION DIVISION.
       PROGRAM-ID. SOMA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(02) VALUE ZEROS.
       77 WRK-NM2 PIC 9(02) VALUE ZEROS.
       77 WRK-RESULT PIC 9(04) VALUE ZEROS.
       77 WRK-RESULT-ED PIC ZZ9 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NM1 FROM CONSOLE.
           ACCEPT WRK-NM2 FROM CONSOLE.
           DISPLAY 'NUMERO 1... ' WRK-NM1.
           DISPLAY 'NUMERO 2...'  WRK-NM2.
           ADD WRK-NM1 WRK-NM2 TO WRK-RESULT.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
            DISPLAY 'A SOMA DOS NUMEROS E...' WRK-RESULT-ED.
           STOP RUN.
