       IDENTIFICATION DIVISION.
       PROGRAM-ID. AULA2.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.

       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
      * IMPRIMINDO SOMENTE UMA PARTE DA VARIÁVEL.
           DISPLAY 'NOME: ' WRK-NOME(1:2).
           STOP RUN.
