       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBTRACAO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(03) VALUE ZEROS.
       77 WRK-NM2 PIC 9(03) VALUE ZEROS.
       77 WRK-RESULT PIC 9(03) VALUE ZEROS.
       77 WRK-RESULT-ED PIC ZZ9 VALUE ZEROS.
       PROCEDURE DIVISION.
       0100-INICAR.
           PERFORM 0200-ENTRADA.
           PERFORM 0300-PROCESSAR.
       STOP RUN.


       0200-ENTRADA.
           DISPLAY 'INFORME O PRIMEIRO VALOR'
           ACCEPT WRK-NM1 FROM CONSOLE.


           DISPLAY 'INFORME O SEGUNDO VALOR'
           ACCEPT WRK-NM2 FROM CONSOLE.



       0300-PROCESSAR.
           SUBTRACT WRK-NM1 FROM WRK-NM2 GIVING WRK-RESULT.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           DISPLAY 'A SUBTRACAO E...' WRK-RESULT-ED.
