       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABUADA.
      ********************************
      * ÁREA DE COMENTÁRIOS -REMARKS
      * AUTHOR = LUAN DE OLIVEIRA MAGALHÃES
      * OBJETIVO = RECEBER UM NÚMERO E GERAR A TABUADA DE 1 A 10.
      * UTILIZANDO O PERFORM - UNTIL


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-VENDAS PIC 9(02) VALUE ZEROS.
       77 WRK-QT PIC 9(02) VALUE 1.
       77 WRK-ACUM PIC 9(08) VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-VENDAS > 0
      * SIMULANDO WHILE, UTILIZANDO UNTIL
               PERFORM 0200-PROCESSAR UNTIL WRK-VENDAS = 0
           END-IF.
           PERFORM 0300-FINALIZAR.

           STOP-RUN.



       0100-INICIALIZAR.
           ACCEPT WRK-VENDAS.




       0200-PROCESSAR.
           ADD 1 TO WRK-QT.
           ADD WRK-VENDAS TO WRK-ACUM.
           PERFORM 0100-INICIALIZAR.



       0300-FINALIZAR.
           DISPLAY '-----------'.
           DISPLAY 'ACUMULADO  ' WRK-ACUM.
           DISPLAY 'QT' WRK-QT.
           DISPLAY 'FINAL DE PROCESSSAMENTO'.
