       IDENTIFICATION DIVISION.
       PROGRAM-ID. Variaveis.
      *************************************
      * AREA DE COMENTARIOS -REMARKS
      * AUTHOR = LUAN
      * OBJETIVO: RECEBER E IMPRIMIR UMA STRING
      * DATA = 21/01/2021
      * OBJETIVO: RECEBER E IMPRIMIR A DATA DO SISTEMA
      * UTILIZAR AS VARIAVEIS COM NÍVEL 01, 02....(ESTRUTURADA)
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * A VARIAVEL DATA IRÁ TER 3 FILHO
      * VARIAVEL DO TIPO ESTRUTURADA, TEM SEU PAI E SEUS FILHOS.
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY ' DATA ' WRK-DIA ' DE ' WRK-MES ' DE ' WRK-ANO.
           STOP RUN.
