       IDENTIFICATION DIVISION.
       PROGRAM-ID. Variaveis.
      *************************************
      * AREA DE COMENTARIOS -REMARKS
      * AUTHOR = LUAN
      * OBJETIVO: RECEBER E IMPRIMIR UMA STRING
      * DATA = 21/01/2021
      * DECLARAÇÃO DE VARIAVEIS
      * A - ALFABETO
      * X - ALFA NÚMERICO
      * 9 - PARA NUMEROS
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * COMO DECLARAR UMA VARIÁVEL COBOL
      * WRK-NOME É O NOME E O PREFIXO DA VARIAVEL
      * X É SEU TIPO
      * X(20) É O NÚMERO DE CASAS
      * VALUE 'JONAS' É O VALOR DA VARIAVEL
      * COMO NÃO QUEREMOS VALORES VAMOS COLOCAR SPACE.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       PROCEDURE DIVISION.
           ACCEPT  WRK-NOME FROM CONSOLE.
           *> DISPLAY 'SEU NOME ' WRK-NOME.
      * IMPRIMINDO SOMENTE ALGUMAS POSICOES DA VARIAVEL
           DISPLAY 'SEU NOME ' WRK-NOME(1:10).
           STOP RUN.
