       IDENTIFICATION DIVISION.
       PROGRAM-ID. Variaveis.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
       DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
     ** SE COLOCARMOS 20220104
     ** 2022 IRA CAIR NA VARIAVEL ANO
     ** 01 IRA CAIR NO MES
     ** 04 IRA CAIR NO DIA
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'DIA.. ' WRK-DIA ' MES...' WRK-MES ' ANO...' WRK-ANO.
           STOP RUN.
