       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABUADA.
      ********************************
      * ÁREA DE COMENTÁRIOS -REMARKS
      * AUTHOR = LUAN DE OLIVEIRA MAGALHÃES
      * OBJETIVO = RECEBER UM NÚMERO E GERAR A TABUADA DE 1 A 10.
      * UTILIZANDO O PERFORM - VARYING


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NUMERO1 PIC 9(02) VALUE ZEROS.
       77 WRK-CONTADOR PIC 9(02) VALUE 1.
       77 WRK-RESUL PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-NUMERO1 > 0
               PERFORM 0200-PROCESSAR
           END-IF.
           PERFORM 0300-FINALIZAR.

           STOP-RUN.



       0100-INICIALIZAR.
           ACCEPT WRK-NUMERO1.




       0200-PROCESSAR.
      * ESTAMOS VARYING PARA IR ENCREMENTANDO NA VARIÁVEL WRK-CONTADOR DE 1 E 1
      * ATÉ CHEGAR NA MARCA DE 10
           PERFORM VARYING WRK-CONTADOR FROM 3 BY 1
                           UNTIL WRK-CONTADOR > 10
                COMPUTE WRK-RESUL = WRK-NUMERO1 * WRK-CONTADOR
                DISPLAY WRK-NUMERO1 ' X ' WRK-CONTADOR ' = ' WRK-RESUL
           END-PERFORM.


       0300-FINALIZAR.
           DISPLAY '-----------'.
           DISPLAY 'FINAL DE PROCESSSAMENTO'.
